In [61]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Path
DOCS_PATH = 'docs/'
DATA_PATH = 'data/'

# Ayiti Analytics Data Processing Bootcamp
  Ayiti Analytics Data wants to expand its training centers throughout all the communes of the country. Your role as a data analyst is to help them realize this dream.

Its objective is to know which three communes of the country will be the most likely to expand its training centers.

Knowing that each cohort must have 30 students
 
* How many applications must be made to select 25% women for each on average

* What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a student to be susceptible to selection
 
* What is the average number of university students who should participate in this program
* What will be the average number of applications per week that we could have
* How many weeks should we extend the application process to select 60 students per commune?
* If we were to do all the bootcamp online, who would be the best communes and how many applications would we need to select 30 student and what percentage of students would have a laptop, an internet connection, both at the same time
* What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a women to be susceptible to selection

### NB 
Use the same framework of the BA project to complete this project

# Commune dataset

In [76]:
# Affiche done commune yo
commune_df = pd.read_excel(DATA_PATH + "commune.xlsx")
commune_df.head(5)

      Commune_en     Commune_FR Commune_Id  Departement ADM1_PCODE
0       Abricots       Abricots     HT0812  Grande'Anse       HT08
1   Acul du Nord   Acul du Nord     HT0321        North       HT03
2  Anse-a-Foleur  Anse-à-Foleur     HT0922   North-West       HT09
3   Anse-a-Pitre   Anse-à-Pître     HT0234   South-East       HT02
4    Anse-a-Veau    Anse-à-Veau     HT1021       Nippes       HT10

#### Step 1. Check rows of NaN

#### Check rows of NaN

#### Clean the data

In [63]:
# Clean done commune yo
commune_df = commune_df.drop(columns=["Commune_FR","ADM1_PCODE"])
commune_df.head(5)

      Commune_en Commune_Id  Departement
0       Abricots     HT0812  Grande'Anse
1   Acul du Nord     HT0321        North
2  Anse-a-Foleur     HT0922   North-West
3   Anse-a-Pitre     HT0234   South-East
4    Anse-a-Veau     HT1021       Nippes

## 2. Enroll Dataset

In [64]:
# Affiche done enroll yo
enroll_df = pd.read_csv(DATA_PATH + "enroll.csv")
enroll_df.head(3)

,Unnamed: 0,created_at,expiry_date,user_id,course_name,course_id,percentage_completed,completed_at,expired,is_free_trial,completed,started_at,activated_at,updated_at,quest_id
0,0,2020-12-12T06:41:29.844Z,NaN,29816173,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-12T06:41:29.844Z,NaN
1,1,2020-12-13T14:41:17.720Z,NaN,35229766,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-13T14:41:17.720Z,NaN
2,2,2020-12-15T00:53:06.499Z,NaN,31987560,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-15T00:53:06.499Z,NaN

## 3. Industry Dataset

In [65]:
# Affiche done industry yo
industry_df = pd.read_csv(DATA_PATH + "industry.csv")
industry_df.head(3)

,Unnamed: 0,key,values,quest_id
0,0,item1,Finance,905ddcf2-ce95-11eb-9a92-7c67a234f601
1,1,item6,Technology (Software/ Internet),905e2608-ce95-11eb-809f-7c67a234f601
2,2,item5,Education,905e2608-ce95-11eb-809f-7c67a234f601

## 4. Ord Dataset

In [66]:
# Affiche done ord yo
ord_df = pd.read_csv(DATA_PATH + "ord.csv")
ord_df.head(3)

,Unnamed: 0,created_at,user_id,product_name,product_id,amount_dollars,amount_cents,subscription,coupon_code,coupon_id,affiliate_referral_code,status,quest_id
0,0,2021-03-14T15:34:35.014Z,41587952,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906b3c86-ce95-11eb-b6a7-7c67a234f601
1,1,2021-03-14T04:20:23.483Z,41564742,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906636cf-ce95-11eb-8679-7c67a234f601
2,2,2021-03-12T19:29:22.832Z,41501853,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906968f5-ce95-11eb-9e1a-7c67a234f601

## 5. Quest dataset

In [67]:
# Affiche done quest yo
quest_df = pd.read_csv(DATA_PATH + "quest.csv")
quest_df.head(3)

,Unnamed: 0,gender,dob,commune,created_at,modified_at,department,education_level,university,study_domain,current_employed,formal_sector_job,have_computer_home,internet_at_home,hear_AA_1,after_AA,quest_id
0,0,male,25/08/1998,ht0111,2021-02-14T23:03:52.768400Z,2021-02-14T23:03:52.768462Z,NaN,unknown,unknown,[],unknown,unknown,unknown,unknown,unknown,unknown,905dc006-ce95-11eb-b2f9-7c67a234f601
1,1,female,29/09/1996,ht0111,2021-02-16T16:01:10.861844Z,2021-02-16T16:01:10.861899Z,ht01,Bachelors (bacc +4),other,['other'],No,unknown,Yes,Yes,Friend,Finding a job/internship,905ddcf2-ce95-11eb-9a92-7c67a234f601
2,2,male,17/05/1996,ht0111,2021-02-16T16:56:30.579504Z,2021-02-16T16:56:30.579563Z,ht01,Bachelors (bacc +4),Université d'Etat d'Haïti (UEH),[],No,unknown,Yes,Yes,Friend,Improving my data analysis skills,905e2608-ce95-11eb-809f-7c67a234f601

## 6. Study domain Dataset

In [68]:
# Affiche done Study domain yo
studyd_df = pd.read_csv(DATA_PATH + "study_domain.csv")
studyd_df.head(3)

   Unnamed: 0    key            values                              quest_id
0           0  other             other  905ddcf2-ce95-11eb-9a92-7c67a234f601
1           1  item1  Computer Science  905e4cf5-ce95-11eb-96a9-7c67a234f601
2           2  item6        Management  905e4cf5-ce95-11eb-96a9-7c67a234f601

## 7. Technology Dataset

In [69]:
# Affiche done technology yo
tech_df = pd.read_csv(DATA_PATH + "technology.csv")
tech_df.head(3)

   Unnamed: 0     key  values                              quest_id
0           0   item1       R  905ddcf2-ce95-11eb-9a92-7c67a234f601
1           1  item11   Excel  905ddcf2-ce95-11eb-9a92-7c67a234f601
2           2   item2  Python  905e2608-ce95-11eb-809f-7c67a234f601

## 8. Transaction dataset

In [70]:
# Affiche done industry yo
transaction_df = pd.read_csv(DATA_PATH + "transaction.csv")
transaction_df.head(3)

,Unnamed: 0,created_at,modified_at,user_id,course_id,transaction_id
0,0,2021-03-08T05:08:50.832Z,2021-03-08T05:08:50.832Z,40976440,1047613,4641281952
1,1,2021-03-08T17:26:35.841Z,2021-03-08T17:26:35.841Z,41179271,1047613,4644270160
2,2,2021-03-08T18:52:09.147Z,2021-03-08T18:52:09.147Z,40973512,1047613,4645070622